package step.learning.OOP;

public interface Copyable {
}
/*
Интерфейсы (В ООП) – абстрактные классы, содержащие
  - только методы
  - только абстрактные
  - только public
Роль интерфейсов зависит от области использования.
  - интерфейсы-маркеры: как правило, интерфейсы без методов (или с малым количеством),
     которые замечают классы как принадлежащие к определенной группе
  - интерфейсы-контракты: набор методов, необходимых для реализации для целей
     включение объектов в определенную функциональность
  - DIP (принцип с SOLID) Dependency Inversion Principle
* */